In [44]:
import pandas as pd
import numpy as np
import seaborn as sns

In [45]:
df = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

In [46]:
def drop_and_convert(df):
    df.drop(["Name", "Ticket", "Cabin", "Embarked", "PassengerId"], axis = 1, inplace = True)
    df.fillna(df.mean(), inplace = True)
    df.replace(to_replace = "male", value = 0, inplace = True)
    df.replace(to_replace = "female", value = 1, inplace = True)
    return df

drop_test = drop_and_convert(test)
drop_df = drop_and_convert(df)

/tmp/ipykernel_32859/773565224.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean(), inplace = True)
/tmp/ipykernel_32859/773565224.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean(), inplace = True)

In [47]:
drop_df

     Survived  Pclass  Sex        Age  SibSp  Parch     Fare
0           0       3    0  22.000000      1      0   7.2500
1           1       1    1  38.000000      1      0  71.2833
2           1       3    1  26.000000      0      0   7.9250
3           1       1    1  35.000000      1      0  53.1000
4           0       3    0  35.000000      0      0   8.0500
..        ...     ...  ...        ...    ...    ...      ...
886         0       2    0  27.000000      0      0  13.0000
887         1       1    1  19.000000      0      0  30.0000
888         0       3    1  29.699118      1      2  23.4500
889         1       1    0  26.000000      0      0  30.0000
890         0       3    0  32.000000      0      0   7.7500

[891 rows x 7 columns]

In [17]:
#df.fillna(df.mean(), inplace=True)

In [24]:
#df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
dtype: int64

In [27]:
#df.drop(["PassengerId"], axis = 1, inplace = True)
#df.head()

   Survived  Pclass   Age  SibSp  Parch     Fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [48]:
data = ["Pclass", "SibSp", "Parch", "Fare", "Age", "Sex"]
label = "Survived"

x = df[data]
y = df[label]
print(x)
print(y)

     Pclass  SibSp  Parch     Fare        Age  Sex
0         3      1      0   7.2500  22.000000    0
1         1      1      0  71.2833  38.000000    1
2         3      0      0   7.9250  26.000000    1
3         1      1      0  53.1000  35.000000    1
4         3      0      0   8.0500  35.000000    0
..      ...    ...    ...      ...        ...  ...
886       2      0      0  13.0000  27.000000    0
887       1      0      0  30.0000  19.000000    1
888       3      1      2  23.4500  29.699118    1
889       1      0      0  30.0000  26.000000    0
890       3      0      0   7.7500  32.000000    0

[891 rows x 6 columns]
0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [49]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression(verbose = 1)
model.fit(x, y)

RUNNING THE L-BFGS-B CODE

           * * *

Machine precision = 2.220D-16
 N =            7     M =           10

At X0         0 variables are exactly at the bounds

At iterate    0    f=  6.17594D+02    |proj g|=  3.46693D+03

At iterate   50    f=  4.01749D+02    |proj g|=  1.27409D+02

[Parallel(n_jobs=1)]: Using backend SequentialBackend with 1 concurrent workers.
 This problem is unconstrained.
[Parallel(n_jobs=1)]: Done   1 out of   1 | elapsed:    0.0s finished

LogisticRegression(verbose=1)

           * * *

Tit   = total number of iterations
Tnf   = total number of function evaluations
Tnint = total number of segments explored during Cauchy searches
Skip  = number of BFGS updates skipped
Nact  = number of active bounds at final generalized Cauchy point
Projg = norm of the final projected gradient
F     = final function value

           * * *

   N    Tit     Tnf  Tnint  Skip  Nact     Projg        F
    7     89    103      1     0     0   8.592D-02   3.987D+02
  F =   398.65972325820428

CONVERGENCE: REL_REDUCTION_OF_F_<=_FACTR*EPSMCH

In [50]:
#test = pd.read_csv("test.csv")
#test_with_ID = test.copy()
test.head()

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    0  34.5      0      0   7.8292
1       3    1  47.0      1      0   7.0000
2       2    0  62.0      0      0   9.6875
3       3    0  27.0      0      0   8.6625
4       3    1  22.0      1      1  12.2875

In [45]:
#test.drop(["Name", "Ticket", "Cabin", "Embarked", "PassengerId"], axis = 1, inplace = True)
#test_with_ID.drop(["Name", "Ticket", "Cabin", "Embarked"], axis = 1, inplace = True)
#test.fillna(test.mean(), inplace=True)
#test.head()
#test.isnull().sum()

Pclass    0
Age       0
SibSp     0
Parch     0
Fare      0
dtype: int64

In [51]:
drop_test

     Pclass  Sex       Age  SibSp  Parch      Fare
0         3    0  34.50000      0      0    7.8292
1         3    1  47.00000      1      0    7.0000
2         2    0  62.00000      0      0    9.6875
3         3    0  27.00000      0      0    8.6625
4         3    1  22.00000      1      1   12.2875
..      ...  ...       ...    ...    ...       ...
413       3    0  30.27259      0      0    8.0500
414       1    1  39.00000      0      0  108.9000
415       3    0  38.50000      0      0    7.2500
416       3    0  30.27259      0      0    8.0500
417       3    0  30.27259      1      1   22.3583

[418 rows x 6 columns]

In [52]:
data_test = ["Pclass", "SibSp", "Parch", "Fare", "Age", "Sex"]
data_pred = test[data_test]

In [53]:
#data_test = ["Pclass", "SibSp", "Parch", "Fare", "Age", "Sex"]
#data_pred = test[data_test]

In [53]:
output = model.predict(data_pred)

In [55]:
#test_with_ID.PassengerId
test_with_ID

     Pclass  Sex       Age  SibSp  Parch      Fare
0         3    0  34.50000      0      0    7.8292
1         3    1  47.00000      1      0    7.0000
2         2    0  62.00000      0      0    9.6875
3         3    0  27.00000      0      0    8.6625
4         3    1  22.00000      1      1   12.2875
..      ...  ...       ...    ...    ...       ...
413       3    0  30.27259      0      0    8.0500
414       1    1  39.00000      0      0  108.9000
415       3    0  38.50000      0      0    7.2500
416       3    0  30.27259      0      0    8.0500
417       3    0  30.27259      1      1   22.3583

[418 rows x 6 columns]

In [63]:
joined_data = list(zip(test_with_ID.PassengerId, output))

In [67]:
create_new_dataframe = pd.DataFrame(joined_data, columns = ["PassengerId", "Survived"])

In [70]:
create_new_dataframe.to_csv("ml_predictions_of_survival.csv", index=False)